# -*- mode:org; fill-column:79; -*-

#+title:HackerRank Coding Problems
#+subtitle:{{{date}}} {{{version}}}
#+date:2019-07-28 09:38
#+macro:version Version 0.11.24

**** Dynamic Array Test
#+name:dynamic-array-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/arrays/node :results output :exports results
#+begin_src sh -n :tangle data-structures/arrays/node/dynamic.test.js
echo Input:
echo \
'2 5
1 0 5
1 1 7
1 0 3
2 1 0
2 1 1' | node dynamic.js
#+end_src

#+RESULTS: dynamic-array-test
#+begin_example
Input:
N = 2
Q = 5
Query: 1,0,5
Query: 1,1,7
Query: 1,0,3
Query: 2,1,0
Query: 2,1,1

Results:
7
3
#+end_example

**** Print Linked List Test Data
#+name:print-linked-list-test
#+header: :dir data-structures/linked_lists/node
#+header: :results output :exports results
#+begin_src sh -n :tangle data-structures/linked_lists/node/print_linked_list.test.sh
echo '2
16
13' | node print_linked_list.js
#+end_src

#+RESULTS: print-linked-list-test
: n = 2
: data = 16
: data = 13
: 16
: 13

**** Reverse a Linked List Test Function
#+name:reverse-llist-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/linked_lists/node :results output :exports results
#+begin_src sh -n :tangle data-structures/linked_lists/node/reverse_llist.test.sh
export OUTPUT_PATH=reverse_llist_results
echo \
'1
5
1
2
3
4
5' | node reverse_llist.js
echo
echo 'Results:'
cat reverse_llist_results
#+end_src

#+RESULTS: reverse-llist-test
#+begin_example
tests: 1

test: 0
n: 5
data: 1
data: 2
data: 3
data: 4
data: 5
write node: 5
write node: 4
write node: 3
write node: 2
write node: 1

Results:
5 4 3 2 1
#+end_example

**** Compare Linked Lists Tests
#+name:compare-llists-tests
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/linked_lists/node
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/linked_lists/node/compareLLists.tests.sh
export OUTPUT_PATH=compare-llists-results
echo Inputs
echo \
'2
2
1
2
1
1
2
1
2
2
1
2' | node compareLLists.js
echo
echo Results
cat compare-llists-results
#+end_src

#+RESULTS: compare-llists-tests
#+begin_example
Inputs
number of tests t = 2

test: 0
n: 2
data: 1
data: 2
m: 1
data: 1
result: 0

test: 1
n: 2
data: 1
data: 2
m: 2
data: 1
data: 2
result: 1

Results
0
1
#+end_example
**** Insert Node at a Set Position in a LList Test
#+name:insert-node-set-pos-llist-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/linked_lists/node
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/linked_lists/node/insert_node_pos_llist.test.sh
export OUTPUT_PATH=insert-node-pos-results
echo Inputs:
echo \
'3
16
13
7
1
2' | node insert_node_pos_llist.js
echo
echo Results
cat insert-node-pos-results
#+end_src

#+RESULTS: insert-node-set-pos-llist-test
#+begin_example
Inputs:
n: 3
data: 16
data: 13
data: 7
data to insert: 1
at position: 2

Results
16 13 1 7
#+end_example

**** Merge Two Sorted Linked Lists Test
#+name:merge-two-sorted-llists-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/linked_lists/node
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/linked_lists/node/merge_2_sorted_llists.test.sh
export OUTPUT_PATH=merge-2-sorted-llists-results
echo Inputs:
echo \
'1
3
1
2
3
2
3
4' | node merge_2_sorted_llists.js
echo
echo Results
cat merge-2-sorted-llists-results
#+end_src

#+RESULTS: merge-two-sorted-llists-test
#+begin_example
Inputs:
t: 1
n: 3
data: 1
data: 2
data: 3
m: 2
data: 3
data: 4

Results
1 2 3 3 4
#+end_example

**** Get node Value Tests
#+name:get-node-value-tests
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/linked_lists/node
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/linked_lists/node/get_node_value.test.sh
export OUTPUT_PATH=get-node-value-results
echo Inputs:
echo \
'2
1
1
0
3
3
2
1
2' | node get_node_value.js
echo
echo Results:
cat get-node-value-results
#+end_src

#+RESULTS: get-node-value-tests
: Inputs:
: tests: 2
: 
: test: 0
: n: 1
: data: 1
: find data at position: 0
: 
: Results:

**** Preorder Traversal Python Test
#+name:python-trees-preorder-traversal-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/trees/python
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/trees/python/preorder_traversal.test.sh
echo \
'6
1 2 5 3 6 4' | python3 preorder_traversal.py
#+end_src

#+RESULTS: python-trees-preorder-traversal-test
: Inputs:
: t: 6
: arr: [1, 2, 5, 3, 6, 4]
: Results:
: 1 2 5 3 4 6 

**** Data Structures---Trees---Inorder Traversal Test
#+name:data-structures-trees-inorder-traversal-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/trees/python
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/trees/python/inorder_traversal.test.sh
echo Inputs:
echo \
'6
1 2 5 3 6 4' | python3 inorder_traversal.py
#+end_src

#+RESULTS: data-structures-trees-inorder-traversal-test
: Inputs:
: t: 6
: arr: [1, 2, 5, 3, 6, 4]
: Results:
: 1 2 3 4 5 6 

**** Data Structures---Trees---Postorder Traversal Test
#+name:data-structures-trees-postorder-traversal-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir data-structures/trees/python
#+header: :results output :exports results
#+begin_src sh :tangle data-structures/trees/python/postorder_traversal.test.sh
echo Inputs:
echo \
'6
1 2 5 3 6 4' | python3 postorder_traversal.py
#+end_src

#+RESULTS: data-structures-trees-postorder-traversal-test
: Inputs:
: t: 6
: arr: [1, 2, 5, 3, 6, 4]
: Results:
: 4 3 6 5 2 1 

**** Ten Days of JavaScript Day 1 Functions Test
#+name:ten-days-of-javascript-day-1-functions-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir ten-days-of-javascript/day-1
#+header: :results output :exports results
#+begin_src sh :tangle ten-days-of-javascript/day-1/functions.test.sh
echo Inputs:
echo 4 | node functions.js
#+end_src

#+RESULTS: ten-days-of-javascript-day-1-functions-test
: Inputs:
: n: 4
: Result:
: 4!:
: 24
**** Conditional Statements---If-Else Test
#+name:conditional-statements-if-else-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir ten-days-of-javascript/day-2
#+header: :results output :exports results
#+begin_src sh :tangle ten-days-of-javascript/day-2/conditional_if_else.test.sh
echo 11 | node conditional_if_else.js
#+end_src

#+RESULTS: conditional-statements-if-else-test
: score: 11
: Score: D

**** Conditional Statements--Switch Test
#+name:ten-days-of-javascript-day-2-conditional-statements-switch-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir ten-days-of-javascript/day-2
#+header: :results output :exports results
#+begin_src sh +n :tangle ten-days-of-javascript/day-2/conditional_statements_switch.test.sh
echo 'adfgt' | node conditional_statements_switch.js
#+end_src

#+RESULTS: ten-days-of-javascript-day-2-conditional-statements-switch-test
: s: adfgt
: Letter: A

**** Ten Days of JavaScript---Day 3---Arrays Test
#+name:ten-days-of-javascript-day-3-arrays-test
#+header: :shebang "#!/usr/bin/env bash"
#+header: :dir ten-days-of-javascript/day-3
#+header: :results output :exports results
#+begin_src sh :tangle ten-days-of-javascript/day-3/arrays.test.sh
echo Inputs:
echo \
'5
5 1 4 2 3' | node arrays.js
#+end_src

#+RESULTS: ten-days-of-javascript-day-3-arrays-test
: Inputs:
: n: 5
: nums: 5,1,4,2,3
: Result:
: 4

